{
  "personalInfo": {
    "name": "Thomas BARKATS",
    "title": "Software Engineer (web, Full-stack)",
    "location": "Montréal, QC, Canada",
    "phone": "+1 263-382-1780 / +33 784451787",
    "email": "thomasbarkats@gmail.com",
    "linkedin": "linkedin.com/in/thomas-barkats",
    "github": "github.com/thomasbarkats"
  },
  "summary": {
    "paragraphs": [
      "👋 I'm Thomas BARKATS, a passionate about software & engineering development with a strong foundation as a full-stack lead developer. I thrive on technical challenges and am constantly seeking opportunities to learn and grow. I have extensive experience in the world of JavaScript / TypeScript / Node.js, but am always open to exploring other languages, as I believe the key is understanding the logic, algorithms, and fundamentals behind the code.",
      "📈 In recent years, I have transitioned towards project management, where I've enjoyed combining my technical knowledges with leadership and strategic planning. I am eager to continue down this path, as I find great satisfaction in guiding projects from conception to completion."
    ]
  },
  "skills": {
    "technical": [
      ["JS / TS / NodeJS", 3],
      ["Angular 14+", 3],
      ["ReactJS", 3],
      ["HTML / CSS", 3],
      ["MongoDB", 3],
      ["SQL and related DB", 2],
      ["Bash / Linux", 2],
      ["Python 3+", 2],
      ["Java / Spring", 1]
    ],
    "architectural": [
      ["API REST / RESTful", 3],
      ["SOLID / DDD", 2],
      ["CI/CD Principles", 1],
      ["Unit Testing / TDD", 2]
    ],
    "application": [
      ["Git / GitHub", 3],
      ["JIRA / Confluence", 3],
      ["OpenShift", 3]
    ],
    "other": [
      ["Project Management", 2],
      ["UX / UI Best practices", 2],
      ["Agile Scrum", 3]
    ]
  },
  "experience": [
    {
      "title": "Technical Lead / Delivery & Management Support",
      "company": "CGI, Toulouse, FR",
      "period": "2021-11 - Present",
      "sections": [
        {
          "title": "Enterprise Architecture projects (Airbus)",
          "items": [
            "Technical Leadership: Oversaw a cross-project development pool, including project assignments and the establishment of technical guidelines (team of 5 to 10 people).",
            "Participation in the technical implementation from scratch of a new data hub and data quality management platform for Airbus Aircraft ; and to the organizational set-up.",
            "Client Engagement/Relations: Acted as a Proxy Product Owner, engaging with the current client to explore new feature opportunities and drive project expansion. Facilitated regular updates and discussions to ensure client satisfaction and address any concerns.",
            "Continued leading the development of \"MyPortfolio\" (team of 3 to 5 people) the data management platform for Airbus Aircraft, focusing on continuous improvement, technical oversight, enhanced development environments through DevOps practices such as continuous integration and deployment."
          ]
        },
        {
          "title": "Enterprise Architecture Repository project (CGI side)",
          "items": [
            "Delivery Follow-up: Monitoring of operational and financial delivery, and regular contract renewal (service catalog model), with the support and under the responsibility of the scope project manager.",
            "Supported Director in creating delivery tracking templates tailored to our contractual model (service catalog), that can be used to standardize and improve our follow-up on all our scope."
          ]
        },
        {
          "title": "Additional Responsibilities (CGI)",
          "text": "Support for my VP in our sector as training manager. Follow-up of a training budget and a training plan for our members (up to 60 members)."
        }
      ]
    },
    {
      "title": "Full-stack Developer / Lead Support",
      "company": "CGI, Toulouse, FR",
      "period": "2018-12 - 2021-11",
      "sections": [
        {
          "title": "MyPortfolio Platform Development",
          "items": [
            "Full-stack Development: Led front-end and back-end web development tasks using contributing to both the build and run phases.",
            "Acted as Lead Developer and Scrum Master role in a small Agile team (team of 3 to 5 people), facilitating sprints and maintaining direct communication with customers.",
            "Deployment and Configuration: Managed solution deployment, including server and route configurations, utilizing OpenShift for a streamlined deployment process.",
            "User Support and Documentation: Established user support processes and authored comprehensive user documentation to enhance platform usability."
          ]
        }
      ]
    }
  ],
  "education": {
    "degree": "Digital Application Designer & Developer",
    "school": "IPI, école d'informatique (bachelor's degree)",
    "period": "2018 - 2021",
    "details": [
      "One of the only schools to offer a work-study program from the 1st year",
      "Design and development of web / mobile / desktop applications (eg. React / Java / Python)",
      "Network & security concepts, algorithmic, and Computer Science in general"
    ]
  },
  "additional": {
    "languages": [
      "French (Native)",
      "English (Business Level, TOEIC)"
    ],
    "certifications": [
      "Certification Scrum Master PSM I."
    ],
    "sideProjects": {
      "title": "Yasui (npmjs.com/yasui)",
      "description": "A small framework built from-scratch over Express - inspired by NestJS for concepts - facilitating Node.js API setup."
    }
  }
}
